In [1]:
import pandas as pd
import numpy as np

## Challenge 01

In [2]:

data = [
    ["Amine", 28, "Casablanca"],
    ["Lina", 22, "Rabat"],
    ["Youssef", 35, "Fès"],
    ["Salma", 30, "Casablanca"],
    ["Nora", np.nan, "Tanger"]
]

In [3]:
df = pd.DataFrame(data, columns=["Nom", "Age", "Ville"])

In [4]:
df.head()

       Nom   Age       Ville
0    Amine  28.0  Casablanca
1     Lina  22.0       Rabat
2  Youssef  35.0         Fès
3    Salma  30.0  Casablanca
4     Nora   NaN      Tanger

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nom     5 non-null      object
 1   Age     4 non-null      float64
 2   Ville   5 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes

## Challenge 02

In [6]:
df["Ville"]

0    Casablanca
1         Rabat
2           Fès
3    Casablanca
4        Tanger
Name: Ville, dtype: object

In [7]:
df[df["Age"] > 25]

       Nom   Age       Ville
0    Amine  28.0  Casablanca
2  Youssef  35.0         Fès
3    Salma  30.0  Casablanca

In [8]:
df[df["Ville"] == "Casablanca"][["Nom", "Ville"]]

     Nom       Ville
0  Amine  Casablanca
3  Salma  Casablanca

## Challenge 03

In [ ]:
df["Annee_naissance"] = 2025 - df["Age"]

In [11]:
df["Nom"] = df["Nom"].str.upper()

In [12]:
df = df.rename(columns={"Ville": "Localisation"})

In [13]:
df

       Nom   Age Localisation  Annee_naissance
0    AMINE  28.0   Casablanca           1997.0
1     LINA  22.0        Rabat           2003.0
2  YOUSSEF  35.0          Fès           1990.0
3    SALMA  30.0   Casablanca           1995.0
4     NORA   NaN       Tanger              NaN

## Challenge 04

In [14]:
df.loc[1, "Age"] = np.nan

In [15]:
df[df.isnull().any(axis=1)]

    Nom  Age Localisation  Annee_naissance
1  LINA  NaN        Rabat           2003.0
4  NORA  NaN       Tanger              NaN

In [16]:
mean_age = df["Age"].mean()
df["Age"] = df["Age"].fillna(mean_age)

In [17]:
df

       Nom   Age Localisation  Annee_naissance
0    AMINE  28.0   Casablanca           1997.0
1     LINA  31.0        Rabat           2003.0
2  YOUSSEF  35.0          Fès           1990.0
3    SALMA  30.0   Casablanca           1995.0
4     NORA  31.0       Tanger              NaN

In [18]:
df_sorted = df.sort_values(by="Age", ascending=False)
df_sorted

       Nom   Age Localisation  Annee_naissance
2  YOUSSEF  35.0          Fès           1990.0
1     LINA  31.0        Rabat           2003.0
4     NORA  31.0       Tanger              NaN
3    SALMA  30.0   Casablanca           1995.0
0    AMINE  28.0   Casablanca           1997.0

In [19]:
df_sorted = df_sorted.drop(columns=["Annee_naissance"])

In [20]:
df_sorted = df_sorted.drop(index=df_sorted.index[0])

In [21]:
df_sorted

     Nom   Age Localisation
1   LINA  31.0        Rabat
4   NORA  31.0       Tanger
3  SALMA  30.0   Casablanca
0  AMINE  28.0   Casablanca